Config/ExchangePlans/ОбменЗГУБГУ2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ExchangePlan>
		<Properties>
			<Name>ОбменЗГУБГУ2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПервичныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БухучетНатуральныхДоходов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьРешениеОКомандировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентГПХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьДанныеСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВыгрузкиДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьЦМО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

Config/ExchangePlans/ОбменЗГУБГУ2/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

Процедура ПриПолученииНастроек(Настройки) Экспорт
	
	Настройки.ПредупреждатьОНесоответствииВерсийПравилОбмена = Ложь;  
	Настройки.ПланОбменаИспользуетсяВМоделиСервиса = Истина;
	Настройки.НазначениеПланаОбмена = "СинхронизацияСДругойПрограммой";
	
	Настройки.Алгоритмы.ПриПолученииОписанияВариантаНастройки = Истина;
	Настройки.Алгоритмы.ОписаниеОграниченийПередачиДанных = Истина;
	
	Настройки.ИмяКонфигурацииИсточника = "БухгалтерияГосударственногоУчреждения";
	Настройки.ИмяКонфигурацииПриемника.Вставить("ЗарплатаИКадрыГосударственногоУчреждения");

КонецПроцедуры
	
Процедура ПриПолученииОписанияВариантаНастройки(ОписаниеВарианта, ИдентификаторНастройки, ПараметрыКонтекста) Экспорт
	
	ОписаниеВарианта.ЗаголовокКомандыДляСозданияНовогоОбменаДанными = НСтр("ru = '""1С: Зарплата и кадры государственного учреждения, редакция 3""'");
	ОписаниеВарианта.ИмяФайлаНастроекДляПриемника = НСтр("ru = 'Настройки обмена БГУ, ред. 2 - ЗГУ, ред. 3'"); 
	ОписаниеВарианта.ИспользуемыеТранспортыСообщенийОбмена = ОбщегоНазначенияБГУ.ИспользуемыеТранспортыСообщенийОбмена();  
	ОписаниеВарианта.ИмяФормыСозданияНачальногоОбраза = "ОбщаяФорма.СозданиеНачальногоОбразаСФайлами";
	ОписаниеВарианта.ИспользоватьПомощникСозданияОбменаДанными = Истина;
	ОписаниеВарианта.КраткаяИнформацияПоОбмену = НСтр("ru = 'Обмен с ""1С: Зарплата и кадры государственного учреждения, редакция 3""'");
	ОписаниеВарианта.ПодробнаяИнформацияПоОбмену = "ПланОбмена.ОбменЗГУБГУ2.Форма.ПодробнаяИнформация"; 
	
	ОписаниеВарианта.ИмяКонфигурацииКорреспондента = "ЗарплатаИКадрыГосударственногоУчреждения";
	ОписаниеВарианта.НаименованиеКонфигурацииКорреспондента = НСтр("ru = '1С: Зарплата и кадры государственного учреждения, редакция 3'");
	
КонецПроцедуры
	
#Область Обработчики

// Возвращает строку описания ограничений миграции данных для пользователя;
// Прикладной разработчик на основе установленных отборов на узле должен сформировать строку описания ограничений 
// удобную для восприятия пользователем.
// 
// Параметры:
//  НастройкаОтборовНаУзле - Структура - структура отборов на узле плана обмена,
//                                       полученная при помощи функции НастройкаОтборовНаУзле().
// 
// Возвращаемое значение:
//  Строка, Неогранич. - строка описания ограничений миграции данных для пользователя
//
Функция ОписаниеОграниченийПередачиДанных(НастройкаОтборовНаУзле, ВерсияКорреспондента, ИдентификаторНастройки) Экспорт
	ШаблонСтроки = НСтр("ru='Настройки обмена данными для отражения заработной платы в учете
							|%1: %2'");
	Если НастройкаОтборовНаУзле.ИспользоватьОтборПоОрганизациям Тогда
		СтрокаОрганизации = СтрСоединить(НастройкаОтборовНаУзле.Организации.Организация, "; ");
		СтрокаПредставлениеОтбораОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, НСтр("ru='Выгружать данные только по организациям'"), СтрокаОрганизации);
	Иначе
		СтрокаПредставлениеОтбораОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, "Выгружать данные", НСтр("ru='по всем организациям'"));
	КонецЕсли;
	
	Если Не НастройкаОтборовНаУзле.БухучетНатуральныхДоходов Тогда
		СтрокаПредставлениеБухучетНатуральныхДоходов = НСтр("ru='Бухгалтерский учет натуральных доходов: Отражать'");
	Иначе
		СтрокаПредставлениеБухучетНатуральныхДоходов = НСтр("ru='Бухгалтерский учет натуральных доходов: Не отражать'");
	КонецЕсли;
	
	ШаблонСтроки = НСтр("ru='Контрагент для учета зарплаты: %1'");
	Если ЗначениеЗаполнено(НастройкаОтборовНаУзле.Контрагент) Тогда
		СтрокаПредставлениеОтбораКонтрагент = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, НастройкаОтборовНаУзле.Контрагент);
	Иначе
		СтрокаПредставлениеОтбораКонтрагент = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, НСтр("ru='не установлен'"));
	КонецЕсли;
	
	ШаблонСтроки = НСтр("ru='Контрагент ГПХ для учета зарплаты: %1'");
	Если ЗначениеЗаполнено(НастройкаОтборовНаУзле.КонтрагентГПХ) Тогда
		СтрокаПредставлениеОтбораКонтрагентГПХ = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, НастройкаОтборовНаУзле.КонтрагентГПХ);
	Иначе
		СтрокаПредставлениеОтбораКонтрагентГПХ = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, НСтр("ru='не установлен'"));
	КонецЕсли;
	
	ШаблонСтроки = НСтр("ru='Вид первичного документа: %1'");
	Если ЗначениеЗаполнено(НастройкаОтборовНаУзле.ВидПервичногоДокумента) Тогда
		СтрокаПредставлениеОтбораВидДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, НастройкаОтборовНаУзле.ВидПервичногоДокумента);
	Иначе
		СтрокаПредставлениеОтбораВидДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, НСтр("ru='не установлен'"));
	КонецЕсли;
	
	
	ШаблонСтроки = НСтр("ru='%1
							|%2
							|%3
							|%4
							|%5'");
							
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, 
																	СтрокаПредставлениеОтбораОрганизации,
																	СтрокаПредставлениеБухучетНатуральныхДоходов,
																	СтрокаПредставлениеОтбораКонтрагент,
																	СтрокаПредставлениеОтбораКонтрагентГПХ,
																	СтрокаПредставлениеОтбораВидДокумента);
КонецФункции

// Возвращает строку описания ограничений миграции данных для базы корреспондента, которая отображается пользователю;
// Прикладной разработчик на основе установленных отборов на узле базы корреспондента должен сформировать строку описания ограничений 
// удобную для восприятия пользователем.
// 
// Параметры:
//  НастройкаОтборовНаУзле - Структура - структура отборов на узле плана обмена базы корреспондента,
//                                       полученная при помощи функции НастройкаОтборовНаУзлеБазыКорреспондента().
// 
// Возвращаемое значение:
//  Строка, Неогранич. - строка описания ограничений миграции данных для пользователя
//
Функция ОписаниеОграниченийПередачиДанныхБазыКорреспондента(НастройкаОтборовНаУзле, ВерсияКорреспондента, ИдентификаторНастройки) Экспорт
	
	ОграничениеДатаНачалаВыгрузкиДокументов = "";
	ОграничениеОтборПоОрганизациям = "";
	ОграничениеВыгружатьПодразделения = "";
	ОграничениеВыгружатьДанныеСотрудников = "";
	
	// дата начала выгрузки документов
	СтрокаДатаНачалаВыгрузки = НСтр("ru='Выгружать документы и справочную информацию [ОграничениеПоДатеВыгрузки]'");
	
	Если ЗначениеЗаполнено(НастройкаОтборовНаУзле.ДатаНачалаВыгрузкиДокументов) Тогда
		
		// "Выгружать документы, начиная с 1 января 2009г."
		ОграничениеДатаНачалаВыгрузкиДокументов = НСтр("ru='начиная с [ДатаНачалаВыгрузкиДокументов]'");
		ОграничениеДатаНачалаВыгрузкиДокументов = СтрЗаменить(ОграничениеДатаНачалаВыгрузкиДокументов, "[ДатаНачалаВыгрузкиДокументов]", Формат(НастройкаОтборовНаУзле.ДатаНачалаВыгрузкиДокументов, "ДЛФ=DD"));
		
	Иначе
		
		ОграничениеДатаНачалаВыгрузкиДокументов = НСтр("ru='за весь период ведения учета в программе'");
		
	КонецЕсли;
	
	ОграничениеДатаНачалаВыгрузкиДокументов = СтрЗаменить(СтрокаДатаНачалаВыгрузки, "[ОграничениеПоДатеВыгрузки]", ОграничениеДатаНачалаВыгрузкиДокументов);
	
	// отбор по организациям
	Если НастройкаОтборовНаУзле.ИспользоватьОтборПоОрганизациям Тогда
		
		СтрокаПредставленияОтбора = СтрСоединить(НастройкаОтборовНаУзле.Организации.Организация, "; ");
		
		ОграничениеОтборПоОрганизациям = НСтр("ru='только по организациям: [СтрокаПредставленияОтбора]'");
		ОграничениеОтборПоОрганизациям = СтрЗаменить(ОграничениеОтборПоОрганизациям, "[СтрокаПредставленияОтбора]", СтрокаПредставленияОтбора);
		
	Иначе
		
		ОграничениеОтборПоОрганизациям = НСтр("ru='по всем организациям'");
		
	КонецЕсли;
	
	// подразделения
	Если НастройкаОтборовНаУзле.ВыгружатьПодразделения Тогда
		ОграничениеВыгружатьПодразделения = НСтр("ru='Выгружать подразделения организаций: да.'");
	Иначе
		ОграничениеВыгружатьПодразделения = НСтр("ru='Выгружать подразделения организаций: нет.'");
	КонецЕсли;
	
	// данные сотрудников
	Если НастройкаОтборовНаУзле.ВыгружатьДанныеСотрудников Тогда
		ОграничениеВыгружатьДанныеСотрудников = НСтр("ru='Выгружать данные сотрудников:
															|	- сотрудники'");
		
		МассивНастроек = Новый СписокЗначений;
		МассивНастроек.Добавить("ВыгружатьИсториюФИО",					НСтр("ru='- история изменения Ф.И.О.'"));
		МассивНастроек.Добавить("ВыгружатьДокументы",					НСтр("ru='- документы сотрудников'"));
		МассивНастроек.Добавить("ВыгружатьКадровуюИсторию",				НСтр("ru='- кадровая история сотрудников'"));
		МассивНастроек.Добавить("ВыгружатьГражданство",					НСтр("ru='- сведения о гражданстве'"));
		МассивНастроек.Добавить("ВыгружатьФотографии",					НСтр("ru='- фотографии сотрудников'"));
		МассивНастроек.Добавить("ВыгружатьДанныеНачисленийИУдержаний",	НСтр("ru='- данные начислений и удержаний'"));
		
		Для Каждого Настройка Из МассивНастроек Цикл
			Если НастройкаОтборовНаУзле[Настройка.Значение] Тогда
				ОграничениеВыгружатьДанныеСотрудников = ОграничениеВыгружатьДанныеСотрудников + Символы.ПС + Символы.Таб + Настройка.Представление;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ОграничениеВыгружатьДанныеСотрудников = НСтр("ru='Выгружать данные сотрудников: нет.'");
	КонецЕсли;
	
	Результат = НСтр("ru='[ОграничениеДатаНачалаВыгрузкиДокументов]
						|Выгружать документы и справочную информацию [ОграничениеОтборПоОрганизациям]
						|[ОграничениеВыгружатьПодразделения]
						|[ОграничениеВыгружатьДанныеСотрудников]'");
						
	//
	
	Результат = СтрЗаменить(Результат, "[ОграничениеДатаНачалаВыгрузкиДокументов]", ОграничениеДатаНачалаВыгрузкиДокументов);
	Результат = СтрЗаменить(Результат, "[ОграничениеОтборПоОрганизациям]",          ОграничениеОтборПоОрганизациям);
	Результат = СтрЗаменить(Результат, "[ОграничениеВыгружатьПодразделения]", ОграничениеВыгружатьПодразделения);
	Результат = СтрЗаменить(Результат, "[ОграничениеВыгружатьДанныеСотрудников]", ОграничениеВыгружатьДанныеСотрудников);
	
	Возврат Результат;	
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Процедура ЗаполнитьНовыеРеквизиты() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("ЭтотУзел", ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.ЭтотУзел());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбменЗГУБГУ2.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.ОбменЗГУБГУ2 КАК ОбменЗГУБГУ2
	|ГДЕ
	|	ОбменЗГУБГУ2.Ссылка <> &ЭтотУзел
	|	И ОбменЗГУБГУ2.ДатаНачалаВыгрузкиДокументов = ДАТАВРЕМЯ(1, 1, 1)
	|	И ОбменЗГУБГУ2.ВыгружатьПодразделения = ЛОЖЬ
	|	И ОбменЗГУБГУ2.ВыгружатьДанныеСотрудников = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПланОбменаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПланОбменаОбъект.ДатаНачалаВыгрузкиДокументов = НачалоГода(ТекущаяДатаСеанса());
		Если ПланОбменаОбъект.ВыгружатьРешениеОКомандировании Тогда
			ПланОбменаОбъект.ВыгружатьПодразделения = Истина;
			ПланОбменаОбъект.ВыгружатьДанныеСотрудников = Истина;
		КонецЕсли;
		// Второй параметр указывается для обхода ошибки использования ОбновлениеИнформационнойБазы.ЗаписатьДанные для планов обмена.
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПланОбменаОбъект, Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
